src/test/artillery/get-messages-with-text.yml
config:
  target: 'http://localhost:8080/rest'
  http:
    timeout: 10
  plugins:
    metrics-by-endpoint: {}
  processor: "./test-utils.js"
  variables:
     metricsProcessEndpoint : "myProcessEndpoint"  # function used to aggregate endpoints for statistics
  phases:
  - name: "Get messages with text"    # Create messages
    arrivalCount: 1
    duration: 1

scenarios:
  - name: 'Get messages with text'
    weight: 1
    flow:
      - function: "selectUserSkewed"
      - post: # First: login as a user
          url: "/user/auth"
          headers:
            Content-Type: application/json
          json:
            user: "{{ user }}"
            pwd: "{{ pwd }}"
      - function: "genInputText"
      - get:                          # Get messages
          url: "/messages/search?query={{ inputText }}"
          headers:
            Accept: application/json
          capture:
            json: "$"